app/controllers/user_controller.rb

SELECT "users".* FROM "users" WHERE (uid = '100003562633226') ORDER BY "users"."id" ASC LIMIT 1
---
	def show
		#try to select user from database by given userID
		user = User.where("uid = ?", params[:uid]).first